app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "description", "created_at", "updated_at", "deadline") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "New one"], ["description", "With date"], ["created_at", "2018-05-20 17:45:52.019763"], ["updated_at", "2018-05-20 17:45:52.019763"], ["deadline", "2018-05-20 17:45:00"]]
---
  def create
    @task = Task.new(task_params)

    if @task.save